function setup() {
  createCanvas(720, 720);//設定畫布的大小
  colorMode(HSB, 360, 100, 100);//設定HSB色彩模式，色相360，彩度、明度各100
  background(0, 0, 100);//設定背景為白色(雖然色相是紅色，但彩度為0，明度是100)
}

function draw() {
  noStroke();//無邊線
  translate(360, 360);//將原點座標位移至畫布的中間。請參考第7章。
  for (var a = 0; a <= 360; a++) {//利用for迴圈。請參考第3章。
    fill(a, 100, 100);//色相設定 a 變數、彩度及明度均是100。變數請參考第3章。
    rotate(radians(1.0));//旋轉1.0度。角度已透過radians(1.0)函式轉換成弧度。請參考第7章。
    triangle(0, 0, 340, -3.5, 340, 3.5);//繪製三角形
  }
  fill(0, 0, 100);//在上面的白色內圓。同前面的背景色設定
  ellipse(0, 0, 450, 450);//畫圓
}